tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/motorBike/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver volumetricBSplinesMotionSolver;

volumetricBSplinesMotionSolverCoeffs
{
    box
    {
        type    cartesian;
        nCPsU   7;
        nCPsV   7;
        nCPsW   7;
        degreeU 3;
        degreeV 3;
        degreeW 3;

        controlPointsDefinition fromFile;

        confineX1movement false;
        confineX2movement false;
        confineX3movement false;
        confineBoundaryControlPoints false;

        boundUMinCPs ( (true true true) (true true true) );
        boundUMaxCPs ( (true true true) );
        boundVMinCPs ( (true true true) (true true true) );
        boundVMaxCPs ( (true true true) (true true true) );
        boundWMinCPs ( (true true true) );
        boundWMaxCPs ( (true true true) (true true true) );
    }
}

// ************************************************************************* //
